app/controllers/todolists_controller.rb

  def create
    list = List.new(list_params)
    list.save
---
INSERT INTO "lists" ("title", "body", "created_at", "updated_at", "image_id") VALUES (?, ?, ?, ?, ?)